Examinator/src/DataProcessors/ПросроченноеОбучениеСУО/ПросроченноеОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПросроченноеОбучениеСУО</name>
</mdclass:DataProcessor>

Examinator/src/InformationRegisters/УчастникиОбученияСУО/УчастникиОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПреподаватель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Электронное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Общее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>EnumRef.МестаПроведенияМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОтсчетаПродолжительности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПродолжительности</name>
    <type>
      <types>EnumRef.ПродолжительностьОбученияСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПрохожденияОбъектовСУО/СтатусыПрохожденияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПрохожденияОбъектовСУО</name>
  <enumValues>
    <name>Зачислен</name>
  </enumValues>
  <enumValues>
    <name>Проходит</name>
  </enumValues>
  <enumValues>
    <name>Завершил</name>
  </enumValues>
  <enumValues>
    <name>НеЗавершил</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Автомат</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/DataProcessors/ПросроченноеОбучениеСУО/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ПросроченныеМероприятия.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	ЗакрытьВыделенныеПрохождения(Элементы.ПросроченныеМероприятия.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	ПросроченныеМероприятия.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗакрытьВыделенныеПрохождения(Знач МассивСтрок)
	
	Для каждого Элемент Из МассивСтрок Цикл

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УчастникиОбученияСУО.Регистратор КАК ПрохождениеОбучения
			|ИЗ
			|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
			|ГДЕ
			|	УчастникиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
			|	И УчастникиОбученияСУО.Пользователь = &Пользователь
			|	И УчастникиОбученияСУО.Сценарий = &Сценарий";

		Запрос.УстановитьПараметр("Сценарий", Элемент.Сценарий);
		Запрос.УстановитьПараметр("Пользователь", Элемент.Пользователь);
		Запрос.УстановитьПараметр("ПроведениеОбучения", Элемент.ПроведениеОбучения);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда			
			ОбучениеСУО.ПриПрохожденииМероприятия(ВыборкаДетальныеЗаписи.ПрохождениеОбучения, Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил);			
		КонецЕсли;
	
	КонецЦикла;
	
	ПросроченныеМероприятия.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти
